rolodex_api/app/controllers/sitcom_characters_controller.rb

SELECT "sitcom_characters".* FROM "sitcom_characters"
---
    def index
        render json: SitcomCharacter.all