rolodex_api/lib/tasks/mock_data.rake

    task :create_fake_people => :environment do
        json = JSON.parse(File.read(Rails.root.join('test', 'fixtures', 'files', 'mock_user_data.json')))

        json.each do |user_data|
            SitcomCharacter.create(
                name: user_data['name'],
                username: user_data['username'],
                email: user_data['email'],
                website: user_data['website'],
                phone: user_data['phonne'],
                address: {
                    street: user_data['street'],
                    suite: user_data['suite'],
                    city: user_data['city'],
                    zipcode: user_data['zipcode'],
                    geo: {
                        lat: user_data['lat'],
                        long: user_data['long']
                    }
                },
                company: {
                    name: user_data['company'],
                    catch_phrase: user_data['catchphrase'],
                    bs: user_data['bs']
                }
---
INSERT INTO "sitcom_characters" ("address", "company", "name", "username", "email", "website", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)